{
  "model_type": "siglip_vision_model",
  "architectures": ["SiglipVisionModel"],
  "hidden_size": 1152,
  "intermediate_size": 4304,
  "num_hidden_layers": 27,
  "num_attention_heads": 16,
  "image_size": 384,
  "patch_size": 16,
  "num_channels": 3,
  "hidden_act": "gelu_pytorch_tanh",
  "layer_norm_eps": 1e-06,
  "attention_dropout": 0.0
}
